docs/解决Microsoft-Designer-Compact-Keyboard-设计师键盘的蓝牙问题.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-17 一 16:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdc5a482">1. 解决Microsoft-Designer-Compact-Keyboard-设计师键盘的蓝牙问题</a>
<ul>
<li><a href="#org8d86c12">1.1. 基本说明</a></li>
<li><a href="#orgffaa7ec">1.2. 问题描述</a></li>
<li><a href="#org5b3309f">1.3. 解决做法: 需要用户手动用sudo信任一下</a></li>
<li><a href="#orgac77cef">1.4. 附赠说明</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgdc5a482" class="outline-2">
<h2 id="orgdc5a482"><span class="section-number-2">1.</span> 解决Microsoft-Designer-Compact-Keyboard-设计师键盘的蓝牙问题</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org8d86c12" class="outline-3">
<h3 id="org8d86c12"><span class="section-number-3">1.1.</span> 基本说明</h3>
<div class="outline-text-3" id="text-1-1">
<p>
严格来说，这并不是Microsoft-Designer-Compact-Keyboard-设计师键盘的蓝牙问题，而应该是 <b>任意蓝牙键盘，与KDE蓝牙服务，的通信连接信任问题</b>
</p>

<p>
这一行为并不是BUG，而是正常来说就应该是这样的，只不过 <b>需要用户手动用sudo信任一下</b> 就可以了 (应该是任意蓝牙键盘都是这样的)
</p>
</div>
</div>
<div id="outline-container-orgffaa7ec" class="outline-3">
<h3 id="orgffaa7ec"><span class="section-number-3">1.2.</span> 问题描述</h3>
<div class="outline-text-3" id="text-1-2">
<p>
可以配对(pair)，但就是在配对后
</p>

<p>
按下 <code>任意键</code> 就会直接断开与键盘的蓝牙连接，再次按下 <code>任意键</code> 就会直接重新连接上键盘
</p>

<p>
然后重复循环，像个 <code>莫比乌斯环一样的</code> 导致键盘按下的内容，都无法通过蓝牙有效地输入到系统内。
</p>
</div>
</div>
<div id="outline-container-org5b3309f" class="outline-3">
<h3 id="org5b3309f"><span class="section-number-3">1.3.</span> 解决做法: 需要用户手动用sudo信任一下</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-sh">
# 此 bluetoothctl 是 bluez bluez-utils 的前端工具
# 在 pacman -S bluez bluez-utils 后就可以 systemctl start bluetooth.service 来开启这个前端工具了
sudo systemctl restart bluetooth
bluetoothctl

# 这个&lt;DEVICE&gt;是比如 "00:00:FF:FF:00:00" 这样的名称，在KDE Plasma 6下使用GUI的蓝色界面，同时开着终端就能看到要连接的键盘的&lt;DEVICE&gt;是叫做什么名称
remove &lt;DEVICE&gt;
power off
agent KeyboardDisplay
default-agent
power on
scan on
trust &lt;DEVICE&gt;
pair &lt;DEVICE&gt; 
connect &lt;DEVICE&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgac77cef" class="outline-3">
<h3 id="orgac77cef"><span class="section-number-3">1.4.</span> 附赠说明</h3>
<div class="outline-text-3" id="text-1-4">
<p>
如果使用 <code>Microsoft-Designer-Compact-Keyboard-设计师键盘</code> 3个蓝牙设备全部满了怎么办？
</p>

<div class="org-src-container">
<pre class="src src-nil">扣4个纽扣电池(CR2032)下来，并静置键盘10分钟以上，从而来触发还原出厂设置功能，然后就可以重新连接了。
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-03-17 一 16:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
